backend/test/performance/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    # Warm-up phase: ramp from 1 to 50 req/s
    - duration: 60
      arrivalRate: 1
      rampTo: 50
      name: "Warm-up"
    # Sustained load: 50 req/s for 2 minutes
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    # Peak load: ramp to 100 req/s
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    # Sustained peak: hold at 100 req/s
    - duration: 60
      arrivalRate: 100
      name: "Sustained peak"
    # Cool-down: ramp down to 10 req/s
    - duration: 30
      arrivalRate: 100
      rampTo: 10
      name: "Cool-down"
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./processor.cjs"

scenarios:
  - name: "pipeline smoke load"
    flow:
      - function: "makeIds"
      - post:
          url: "/api/events/prepare"
          json:
            event: "{{ mintEvent }}"
          capture:
            - json: "$.canonical_payload"
              as: "canonical_payload"
            - json: "$.hash"
              as: "hash"
      - post:
          url: "/api/events/dev-sign"
          json:
            canonical_payload: "{{ canonical_payload }}"
          capture:
            - json: "$.sig"
              as: "sig"
            - json: "$.author_pubkey"
              as: "author_pubkey"
      - function: "buildSignedEvent"
      - post:
          url: "/api/events/create"
          json:
            hash: "{{ hash }}"
            event: "{{ signedMintEvent }}"
          capture:
            - json: "$.stored.event_cid"
              as: "event_cid"
      - function: "buildAnchoredPayload"
      - post:
          url: "/api/ingest/anchored-event"
          json:
            content_hash: "{{ hash }}"
            payload: "{{ anchoredPayload }}"
            event_cid: "{{ event_cid }}"
            block_num: 999999
            trx_id: "load-test-trx"
            source: "load-test"
            contract_account: "polaris"
            action_name: "put"